{
"gardenPre":"The gardening website is a project I've created to keep notes on my garden, design new planting areas and maintain a healthy garden. It is my largest web project so far and combines my passion for gardening with an even bigger passion - programming. As a long-time gardening enthusiast, I've collected a lot of plant data, which I used to keep in excel. The problem with that approach was lack of mobility. I designed and developed this site, choosing a  web page as the format, instead of an app, so that it is readily available on any device. My gardening website allows any user to view my gardening notes, design and maintain their garden and add their own notes, stored on their devices without creating an account. Going forward, I plan to add an account creation option so that users can store and access their own notes online, most likely using MongoDB.", 
"garden_home":"The home page of the gardening website is a welcoming screen that describes the whole site and allows me to share things about nature that I find interesting. It's designed in a blog format and coded using HTML, CSS, and JS.", 
"garden_data":"The data page of the gardening website is inspired by MS Excel spreadsheet and is represented by a table of data that I've collected over time spent in the garden. This page allows a user to work with the plants' data through sorting, horizontal and vertical filtering, recording new plants and notes. This is coded using HTML, CSS, and JS.", 
"garden_design":"The visual page of the gardening website that I'm still working on, is intended for planning out the garden site. Developed with HTML, CSS, SVG, and JS, the page includes useful tools, such as selecting plants based on size, sun and soil requirements, plant companionship, etc.", 
"exercizer":"I created this tool mainly to apply and practice my knowledge of MongoDB. The Exercizer allows tracking one's health stats, such as daily workouts, sleep hours and nutrition. The tool is coded using HTML, CSS, EJS, NodeJS, JS, MongoDB and is hosted on Heroku. It is still a work in progress as I am adding user authentication and a few fun features.", 
"task_tracker":"Just like the name implies, the purpose of this site is to allow a user to keep track of their goals. As an iPhone user, I keep my many to-dos in the Notes and Calendar apps. However, I often run into issues of Notes lists not being updated between devices and the Calendar lists disappearing from the view if enough time passes since the list was last checked. Once completed, this site will allow a user to keep their notes in one place and access it from any device. It will also offer different formatting, tracking, etc. This app is in the beginning stage of development.", 
"matchRu":"My goal with the 'MatchRu' app was to engage my kids in practicing their Russian vocabulary and for myself to learn iOS app development in the process. Designed as a matching game, the app allowed a player to match a picture to the written word by listening to the sound of that word.  The game included over 700 words and was great for training the memory. I coded the app with Objective-C in Xcode and created images with Adobe Photoshop. The 'MatchRu' app was available in iTunes for iPads and iPhones in 2017. A snapshot of the game can be viewed <a href='assets/matchRu3.png'>here</a>. I've also set up a company, Objecot LLC to run the distribution of the app as a business."
}